# Import dependencies

In [42]:
import os
import pandas as pd
import numpy as np

# Study data files: Toronto files:

In [43]:
toronto_Q1_path = os.path.join("Resources","2019-Q1.csv")
toronto_Q2_path = os.path.join("Resources", "2019-Q2.csv")
toronto_Q3_path = os.path.join("Resources", "2019-Q3.csv")
toronto_Q4_path = os.path.join("Resources", "2019-Q4.csv")

# Read the data and study the results:

In [44]:
q1 = pd.read_csv(toronto_Q1_path, encoding="utf=8")
q2 = pd.read_csv(toronto_Q2_path, encoding="utf=8")
q3 = pd.read_csv(toronto_Q3_path, encoding="utf=8")
q4 = pd.read_csv(toronto_Q4_path, encoding="utf=8")

Renaming the columns:

In [45]:
q1 = q1.rename(columns={"Trip  Duration": "Trip Duration"})
q2 = q2.rename(columns={"Trip  Duration": "Trip Duration"})
q3 = q3.rename(columns={"Trip  Duration": "Trip Duration"})
q4 = q4.rename(columns={"Trip  Duration": "Trip Duration"})

Creating DataFrame:

In [61]:
Toronto = [q1, q2, q3, q4]
bike_share = pd.concat(Toronto)
bike_share.head()

,Trip Id,Subscription Id,Trip Duration,Start Station Id,Start Time,Start Station Name,End Station Id,End Time,End Station Name,Bike Id,User Type
0,4581278,199751,1547,7021,01/01/2019 00:08,Bay St / Albert St,7233.0,01/01/2019 00:33,King / Cowan Ave - SMART,1296,Annual Member
1,4581279,294730,1112,7160,01/01/2019 00:10,King St W / Tecumseth St,7051.0,01/01/2019 00:29,Wellesley St E / Yonge St (Green P),2947,Annual Member
2,4581280,197252,589,7055,01/01/2019 00:15,Jarvis St / Carlton St,7013.0,01/01/2019 00:25,Scott St / The Esplanade,2293,Annual Member
3,4581281,171700,259,7012,01/01/2019 00:16,Elizabeth St / Edward St (Bus Terminal),7235.0,01/01/2019 00:20,Bay St / College St (West Side) - SMART,283,Annual Member
4,4581282,306314,281,7041,01/01/2019 00:19,Edward St / Yonge St,7257.0,01/01/2019 00:24,Dundas St W / St. Patrick St,1799,Annual Member

Deleting column "Trip Duration,Subscription Id,Start Station Name, End Station Name"

In [47]:
del bike_share['Trip Id']
del bike_share['Subscription Id']
del bike_share['Start Station Name']
del bike_share['End Station Name']
bike_share.head()

,Trip Duration,Start Station Id,Start Time,End Station Id,End Time,Bike Id,User Type
0,1547,7021,01/01/2019 00:08,7233.0,01/01/2019 00:33,1296,Annual Member
1,1112,7160,01/01/2019 00:10,7051.0,01/01/2019 00:29,2947,Annual Member
2,589,7055,01/01/2019 00:15,7013.0,01/01/2019 00:25,2293,Annual Member
3,259,7012,01/01/2019 00:16,7235.0,01/01/2019 00:20,283,Annual Member
4,281,7041,01/01/2019 00:19,7257.0,01/01/2019 00:24,1799,Annual Member

Renaming columns in the created dataframe

In [48]:
bike_share = bike_share.rename(columns={"Trip Duration": "tripduration",
                                        "Start Station Id":"start station id",
                                        "End Station Id":"end station id",
                                        "Start Time":"starttime",
                                        "End Time":"stoptime",
                                        "Bike Id":"bikeid",
                                        "User Type":"usertype"
                                       })
bike_share.head()

,tripduration,start station id,starttime,end station id,stoptime,bikeid,usertype
0,1547,7021,01/01/2019 00:08,7233.0,01/01/2019 00:33,1296,Annual Member
1,1112,7160,01/01/2019 00:10,7051.0,01/01/2019 00:29,2947,Annual Member
2,589,7055,01/01/2019 00:15,7013.0,01/01/2019 00:25,2293,Annual Member
3,259,7012,01/01/2019 00:16,7235.0,01/01/2019 00:20,283,Annual Member
4,281,7041,01/01/2019 00:19,7257.0,01/01/2019 00:24,1799,Annual Member

Identifying incomplete rows and Drop all rows with missing information

In [49]:
bike_share.count()

tripduration        2439517
start station id    2439517
starttime           2439517
end station id      2439063
stoptime            2439517
bikeid              2439517
usertype            2439517
dtype: int64

In [50]:
bike_share = bike_share.dropna()

In [51]:
bike_share.count()

tripduration        2439063
start station id    2439063
starttime           2439063
end station id      2439063
stoptime            2439063
bikeid              2439063
usertype            2439063
dtype: int64

Adding new column:location_id

In [52]:
bike_share = bike_share.assign(location_id=1)
bike_share.head()

,tripduration,start station id,starttime,end station id,stoptime,bikeid,usertype,location_id
0,1547,7021,01/01/2019 00:08,7233.0,01/01/2019 00:33,1296,Annual Member,1
1,1112,7160,01/01/2019 00:10,7051.0,01/01/2019 00:29,2947,Annual Member,1
2,589,7055,01/01/2019 00:15,7013.0,01/01/2019 00:25,2293,Annual Member,1
3,259,7012,01/01/2019 00:16,7235.0,01/01/2019 00:20,283,Annual Member,1
4,281,7041,01/01/2019 00:19,7257.0,01/01/2019 00:24,1799,Annual Member,1

Rearrange columns

In [54]:
bike_share = bike_share[["tripduration","starttime","stoptime",
                         "start station id","end station id","bikeid",
                         "usertype","location_id"]]
bike_share.head()

,tripduration,starttime,stoptime,start station id,end station id,bikeid,usertype,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1

Creating Bikes dataframe with the following columns: BikeID & location_id

In [55]:
bikes = pd.DataFrame(bike_share[["bikeid","location_id"]])
bikes = bikes.drop_duplicates().reset_index(drop=True)
bikes.columns=["BikeID", "LocationID"]
bikes.head()

   BikeID  LocationID
0    1296           1
1    2947           1
2    2293           1
3     283           1
4    1799           1

Creating MemberType dataframe with the following columns: id,type & location_id

In [57]:
MemberType = pd.DataFrame(bike_share[["usertype","location_id"]])
MemberType = MemberType.drop_duplicates().reset_index(drop=True)
MemberType.columns=["Usertype","LocationID"]
MemberType.index = MemberType.index + 1
MemberType.rename_axis('ID')
MemberType

        Usertype  LocationID
1  Annual Member           1
2  Casual Member           1

In [59]:
bike_share

,tripduration,starttime,stoptime,start station id,end station id,bikeid,usertype,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233.0,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051.0,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013.0,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235.0,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257.0,1799,Annual Member,1
...,...,...,...,...,...,...,...,...
468411,523,12/31/2019 23:39,12/31/2019 23:48,7098,7339.0,861,Annual Member,1
468412,273,12/31/2019 23:45,12/31/2019 23:49,7044,7273.0,3776,Annual Member,1
468413,1055,12/31/2019 23:51,01/01/2020 00:08,7100,7100.0,2382,Annual Member,1
468414,459,12/31/2019 23:55,01/01/2020 00:03,7470,7102.0,2800,Annual Member,1
468415,361,12/31/2019 23:58,01/01/2020 00:04,7168,7033.0,4139,Annual Member,1

In [62]:
# Save Combined DataFrames to CSV
bike_share.to_csv("Toronto_bikeshare.csv", index=False, header=True)